Revit 2024 API
StairsRun.ActualRisersNumber Property
 The actual number of stairs risers in the stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public int ActualRisersNumber { get; }
Visual Basic
Public ReadOnly Property ActualRisersNumber As Integer
	Get
Visual C++
public:
property int ActualRisersNumber {
	int get ();
}
Remarks
 This is a read-only value.
See Also
StairsRun Class
Autodesk.Revit.DB.Architecture Namespace